#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# @trojanzhex


class Script(object):

    START_MSG = """<b>ʜᴇʟʟᴏ {},

ɪ ᴄᴀɴ ᴇxᴛʀᴀᴄᴛ ᴀᴜᴅɪᴏ ᴀɴᴅ sᴜʙᴛɪᴛʟᴇs ꜰʀᴏᴍ ᴠɪᴅᴇᴏ ꜰɪʟᴇs.
sᴇɴᴅ ᴍᴇ ᴀɴʏ ᴠɪᴅᴇᴏ ꜰɪʟᴇ ᴀɴᴅ ᴇxᴛʀᴀᴄᴛ ᴡʜᴀᴛ ʏᴏᴜ ᴡᴀɴᴛ :).
sᴇᴇ <i>ʜᴇʟᴘ</i> ꜰᴏʀ ᴍᴏʀᴇ ᴅᴇᴛᴀɪʟs.✨

© @Z_Bots</b>"""


    HELP_MSG = """<b>ʜᴀɪ, ꜰᴏʟʟᴏᴡ ᴛʜᴇsᴇ sᴛᴇᴘs..😊</b>
🌀 <i>sᴇɴᴅ ᴍᴇ ᴀɴʏ ᴠᴀʟɪᴅ ᴠɪᴅᴇᴏ ꜰɪʟᴇ.</i>
🌀 <i>ᴄʟɪᴄᴋ ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴᴅ ᴘʀᴏᴄᴇss ʙᴜᴛᴛᴏɴ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴛʜᴇ ꜰɪʟᴇ ᴛᴏ ᴍʏ sᴇʀᴠᴇʀ</i>
🌀 <i>ᴡᴀɪᴛ ᴛɪʟʟ ɪ ᴘʀᴏᴄᴇss ᴛʜᴇ ᴠɪᴅᴇᴏ!</i>
🌀 <i>ɴᴏᴡ sᴇʟᴇᴄᴛ ᴛʜᴇ sᴛʀᴇᴀᴍ ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ᴇxᴛʀᴀᴄᴛ!</i>

<b>© @Z_Bots</b>"""


    ABOUT_MSG = """<b>ᴍʏ ɴᴀᴍᴇ : sᴛʀᴇᴀᴍs ᴇxᴛʀᴀᴄᴛᴏʀ ʙᴏᴛ</b>
⭕️<b>ᴄʜᴀɴɴᴇʟ :</b>@Z_Bots    
⭕️<b>ʟᴀɴɢᴜᴀɢᴇ :</b><code>ᴘʏᴛʜᴏɴ3</code>
⭕️<b>ɢɪᴛ ᴘʀᴏꜰɪʟᴇ:</b> </b> <a href='https://github.com/madtoazenzio'>ᴍᴀᴅᴛᴏᴀᴢᴇɴᴢɪᴏ :)</a>
⭕️<b>ʟɪʙʀᴀʀʏ :</b> </b> <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ 1.0.7</a>
"""
